; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph4 - mode
	thermograph6 - mode
	image0 - mode
	spectrograph3 - mode
	spectrograph5 - mode
	infrared1 - mode
	spectrograph2 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation2 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite0 Planet5)
	(have_image Planet5 spectrograph2)
	(have_image Star6 thermograph6)
	(have_image Star7 spectrograph5)
	(have_image Phenomenon8 thermograph4)
	(have_image Phenomenon9 infrared1)
))

)

; plan
1. (turn_to satellite1 star4 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 6
6. (take_image satellite1 phenomenon8 instrument2 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 1 of 6
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
8. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 6
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 1 of 6
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 6
11. (turn_to satellite0 phenomenon9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 6
12. (take_image satellite0 phenomenon9 instrument0 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 2 of 6
13. (turn_to satellite0 star6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star6)
   goals met: 2 of 6
14. (take_image satellite0 star6 instrument0 thermograph6)
   added: (have_image star6 thermograph6)
   goals met: 3 of 6
15. (turn_to satellite0 planet5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet5)
   goals met: 4 of 6
16. (turn_to satellite1 groundstation2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation2)
   goals met: 4 of 6
17. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 4 of 6
18. (turn_to satellite1 planet5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet5)
   goals met: 4 of 6
19. (take_image satellite1 planet5 instrument3 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 5 of 6
20. (turn_to satellite1 star7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star7)
   goals met: 5 of 6
21. (take_image satellite1 star7 instrument3 spectrograph5)
   added: (have_image star7 spectrograph5)
   goals met: 6 of 6
